app/controllers/oauth_clients_controller.rb

  def index
    @client_applications = current_user.client_applications
    @tokens = current_user.tokens.find :all, :conditions => 'oauth_tokens.invalidated_at is null and oauth_tokens.authorized_at is not null'
---
SELECT * FROM "client_applications" WHERE ("client_applications".user_id = 1)
SELECT * FROM "oauth_tokens" WHERE ("oauth_tokens".user_id = 1 AND (oauth_tokens.invalidated_at is null and oauth_tokens.authorized_at is not null)) ORDER BY authorized_at desc

  def create
    @client_application = current_user.client_applications.build(params[:client_application])
    if @client_application.save
---
INSERT INTO "client_applications" ("name", "created_at", "support_url", "callback_url", "updated_at", "url", "user_id", "key", "secret") VALUES('John', '2011-02-21 22:17:32', '', 'http://thinknear.com', '2011-02-21 22:17:32', 'http://softwaregravy.com', 1, 'qufHnoO5crGDN4yy7eC5', 'YPBxjGvnU5muRVY7aoSDlXwGC4mJ5UA8Sz0LnIYa')